## Terraform plan (PR)

<details>
<summary>VPC plan</summary>

```
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-084a25f463fa7f468]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0f23694957a867757]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-05a49e93cedb94bb0]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-060f396ed8d94d34c]
module.vpc.aws_default_security_group.this: Refreshing state... [id=sg-062f43b441505c78d]
module.vpc.aws_subnet.private["1"]: Refreshing state... [id=subnet-0f1d9023dcbe64cd9]
module.vpc.aws_subnet.private["0"]: Refreshing state... [id=subnet-0c1938299b95ba587]
module.vpc.aws_subnet.public["1"]: Refreshing state... [id=subnet-031528639553d5a0c]
module.vpc.aws_subnet.public["0"]: Refreshing state... [id=subnet-0945b8a6b3ca08170]
module.vpc.aws_route.public_internet: Refreshing state... [id=r-rtb-060f396ed8d94d34c1080289494]
module.vpc.aws_route_table.private["1"]: Refreshing state... [id=rtb-0e2a78d03b2666005]
module.vpc.aws_route_table.private["0"]: Refreshing state... [id=rtb-08892c4f54fbf67da]
module.vpc.aws_route_table_association.public["1"]: Refreshing state... [id=rtbassoc-0e2756ab48e2ee6e6]
module.vpc.aws_route_table_association.public["0"]: Refreshing state... [id=rtbassoc-0671ad8f23680ca2a]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0cbbcc61707d7fc84]
module.vpc.aws_route_table_association.private["1"]: Refreshing state... [id=rtbassoc-09244e7cc83bbdb32]
module.vpc.aws_route_table_association.private["0"]: Refreshing state... [id=rtbassoc-048419e9f2eac6093]
module.vpc.aws_route.private_nat["1"]: Refreshing state... [id=r-rtb-0e2a78d03b26660051080289494]
module.vpc.aws_route.private_nat["0"]: Refreshing state... [id=r-rtb-08892c4f54fbf67da1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vpc.aws_route.private_nat["2"] will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = "nat-0cbbcc61707d7fc84"
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-east-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route_table.private["2"] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = (known after apply)
      + tags             = {
          + "app"         = "genlogs"
          + "component"   = "network"
          + "environment" = "dev"
          + "managedby"   = "terraform"
          + "owner"       = "DevOps"
          + "project"     = "genlogs-poc"
          + "tier"        = "private"
        }
      + tags_all         = {
          + "app"         = "genlogs"
          + "component"   = "network"
          + "environment" = "dev"
          + "managedby"   = "terraform"
          + "owner"       = "DevOps"
          + "project"     = "genlogs-poc"
          + "tier"        = "private"
        }
      + vpc_id           = "vpc-0f23694957a867757"
    }

  # module.vpc.aws_route_table_association.private["0"] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-048419e9f2eac6093" -> (known after apply)
      ~ subnet_id      = "subnet-0c1938299b95ba587" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private["1"] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-09244e7cc83bbdb32" -> (known after apply)
      ~ subnet_id      = "subnet-0f1d9023dcbe64cd9" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private["2"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public["2"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = "rtb-060f396ed8d94d34c"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private["0"] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:258485600712:subnet/subnet-0c1938299b95ba587" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.0.2.0/24" -> "10.0.3.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0c1938299b95ba587" -> (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "258485600712" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "app"         = "genlogs"
            "component"   = "network"
            "environment" = "dev"
            "managedby"   = "terraform"
            "owner"       = "DevOps"
            "project"     = "genlogs-poc"
            "tier"        = "private"
        }
        # (12 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private["1"] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:258485600712:subnet/subnet-0f1d9023dcbe64cd9" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.0.3.0/24" -> "10.0.4.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0f1d9023dcbe64cd9" -> (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "258485600712" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "app"         = "genlogs"
            "component"   = "network"
            "environment" = "dev"
            "managedby"   = "terraform"
            "owner"       = "DevOps"
            "project"     = "genlogs-poc"
            "tier"        = "private"
        }
        # (12 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private["2"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "app"         = "genlogs"
          + "component"   = "network"
          + "environment" = "dev"
          + "managedby"   = "terraform"
          + "owner"       = "DevOps"
          + "project"     = "genlogs-poc"
          + "tier"        = "private"
        }
      + tags_all                                       = {
          + "app"         = "genlogs"
          + "component"   = "network"
          + "environment" = "dev"
          + "managedby"   = "terraform"
          + "owner"       = "DevOps"
          + "project"     = "genlogs-poc"
          + "tier"        = "private"
        }
      + vpc_id                                         = "vpc-0f23694957a867757"
    }

  # module.vpc.aws_subnet.public["2"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "app"         = "genlogs"
          + "component"   = "network"
          + "environment" = "dev"
          + "managedby"   = "terraform"
          + "owner"       = "DevOps"
          + "project"     = "genlogs-poc"
          + "tier"        = "public"
        }
      + tags_all                                       = {
          + "app"         = "genlogs"
          + "component"   = "network"
          + "environment" = "dev"
          + "managedby"   = "terraform"
          + "owner"       = "DevOps"
          + "project"     = "genlogs-poc"
          + "tier"        = "public"
        }
      + vpc_id                                         = "vpc-0f23694957a867757"
    }

Plan: 10 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ private_subnet_ids = [
      - "subnet-0c1938299b95ba587",
      - "subnet-0f1d9023dcbe64cd9",
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ public_subnet_ids  = [
        # (1 unchanged element hidden)
        "subnet-031528639553d5a0c",
      + (known after apply),
    ]
```
</details>

<details>
<summary>App plan</summary>

```
module.app.data.aws_ami.al2023: Reading...
module.app.aws_iam_role.ec2: Refreshing state... [id=genlogs-dev-ec2-20260130215257373400000003]
data.aws_vpc.selected: Reading...
module.app.aws_iam_role_policy_attachment.ssm[0]: Refreshing state... [id=genlogs-dev-ec2-20260130215257373400000003/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.app.aws_iam_instance_profile.ec2: Refreshing state... [id=genlogs-dev-ec2-20260130215258199400000004]
module.app.data.aws_ami.al2023: Read complete after 1s [id=ami-0e3008cbd8722baf0]
data.aws_vpc.selected: Read complete after 1s [id=vpc-0f23694957a867757]
data.aws_subnets.public: Reading...
data.aws_subnets.private: Reading...
module.app.aws_security_group.app: Refreshing state... [id=sg-01e774ad1e5de32bb]
module.app.aws_security_group.alb: Refreshing state... [id=sg-0764c744d1fd29fca]
module.app.aws_lb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:258485600712:targetgroup/genlogs-dev-tg/6b2e5f91c1244d8d]
data.aws_subnets.public: Read complete after 0s [id=us-east-1]
data.aws_subnets.private: Read complete after 0s [id=us-east-1]
module.app.aws_security_group_rule.app_all_out: Refreshing state... [id=sgrule-2118558895]
module.app.aws_launch_template.app: Refreshing state... [id=lt-0f5b88861bc89f417]
module.app.aws_security_group_rule.alb_all_out: Refreshing state... [id=sgrule-1792067288]
module.app.aws_security_group_rule.alb_http_in: Refreshing state... [id=sgrule-1078653152]
module.app.aws_security_group_rule.app_http_in: Refreshing state... [id=sgrule-1136765591]
module.app.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:258485600712:loadbalancer/app/genlogs-dev-alb/b32a41e3b4b42b38]
module.app.aws_autoscaling_group.app: Refreshing state... [id=genlogs-dev-asg]
module.app.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:258485600712:listener/app/genlogs-dev-alb/b32a41e3b4b42b38/cd80cf425fdde032]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```
</details>
